Fabrimat/Home-CSI/firmware/bringup/csi-hello/sdkconfig.defaults
# csi-hello: the smallest possible configuration that can produce CSI.
CONFIG_IDF_TARGET="esp32"

# Without this, esp_wifi_set_csi() fails and nothing else matters.
CONFIG_ESP_WIFI_CSI_ENABLED=y

# Power save destroys CSI regularity. Off here too, for the same reason as in
# the real firmware.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# The default partition table is fine: this app has no NVS provisioning and
# fits any flash size, on purpose.
CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BT_ENABLED=n
